rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Inc/debug_console.h
#ifndef DEBUG_CONSOLE_H
#define DEBUG_CONSOLE_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "stm32n6xx_hal.h"

/* Optional lock callbacks for thread-safety (FreeRTOS mutex, critical section, etc.) */
typedef void (*DebugConsole_LockCallback_t)(void);
typedef void (*DebugConsole_UnlockCallback_t)(void);

typedef struct {
	UART_HandleTypeDef *uart_handle_pointer;
	uint32_t uart_transmit_timeout_milliseconds;
	DebugConsole_LockCallback_t lock_callback;
	DebugConsole_UnlockCallback_t unlock_callback;
} DebugConsole_Configuration_t;

/* Public API */
bool DebugConsole_Init(
		const DebugConsole_Configuration_t *configuration_pointer);

/* Install or replace lock/unlock callbacks after init — call once ThreadX is running */
void DebugConsole_SetLockCallbacks(DebugConsole_LockCallback_t lock,
		DebugConsole_UnlockCallback_t unlock);

bool DebugConsole_IsInitialized(void);

bool DebugConsole_WriteBytes(const uint8_t *byte_array_pointer,
		size_t byte_array_length);

bool DebugConsole_Printf(const char *format_string_pointer, ...);

bool DebugConsole_VPrintf(const char *format_string_pointer,
		void *va_list_pointer);

/* Convenience: write a C string (no formatting) */
bool DebugConsole_WriteString(const char *null_terminated_string_pointer);

#ifndef DEBUG_CONSOLE_IMPLEMENTATION
/*
 * Keep the logging API easy to disable in size-constrained builds.
 * When enabled, the callsites compile out entirely so their format strings
 * and message literals do not end up in ROM.
 */
#ifndef DEBUG_CONSOLE_ENABLE_LOGS
#define DEBUG_CONSOLE_ENABLE_LOGS 0
#endif

#if !DEBUG_CONSOLE_ENABLE_LOGS
#undef DebugConsole_Printf
#define DebugConsole_Printf(...) ((void) 0)
#undef DebugConsole_VPrintf
#define DebugConsole_VPrintf(...) ((void) 0)
#undef DebugConsole_WriteString
#define DebugConsole_WriteString(...) ((void) 0)
#endif
#endif

#ifdef __cplusplus
}
#endif

#endif /* DEBUG_CONSOLE_H */
